# OnShutdown Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalDBApplication..::..OnShutdown Method
IExternalDBApplication Interface See Also
---
Implement this method to execute some tasks when Autodesk Revit shuts down.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
ExternalDBApplicationResult OnShutdown(
	ControlledApplication application
)
```

Visual Basic
---
```text
Function OnShutdown ( _
	application As ControlledApplication _
) As ExternalDBApplicationResult
```

Visual C++
---
```text
ExternalDBApplicationResult OnShutdown(
	ControlledApplication^ application
)
```

# ### Parameters
application
    Type: Autodesk.Revit.ApplicationServices..::..ControlledApplication Handle to the Revit Application object.
# ### Return Value
Indicates if the external db application completes its work successfully.
# See Also
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace